Revit 2024 API
BuiltInFailures.OverlapFailures.DuplicatePoints Property
 There are identical points in the same place. Lines created from points may not work as expected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicatePoints { get; }
Visual Basic
Public Shared ReadOnly Property DuplicatePoints As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicatePoints {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace